In [1]:
import pandas as pd

In [2]:
movies=pd.read_clipboard()

EmptyDataError: No columns to parse from file

In [ ]:
movies

In [ ]:
movies=pd.read_csv(r'MY DATA.csv',index_col=0)

In [ ]:
movies

In [ ]:
movies['DURATION'].argmax()

1-Find the longest movie name

In [ ]:
movies['NAME'][7]

In [ ]:
movies['NAME'][movies['DURATION'].argmax()]

2- Number of movies who got 10 rating ?

In [ ]:
sum(movies['RATING']==10)

how many industries are there

In [ ]:
movies['INDUSTRY'].value_counts()

In [ ]:
movies['GENRE']

In [ ]:
movies['GENRE']=='COMEDY '

find the least liked comedy mmovie

In [ ]:
movies['NAME'][movies[movies['GENRE']=='COMEDY ']['RATING'].idxmin()]

In [ ]:
movies.columns

5. Longest english movie name

In [ ]:
movies['NAME'][movies[movies['LANGUAGE']=='ENGLISH']['DURATION'].idxmax()]

## what is the Genre of intersteller

In [ ]:
movies['GENRE'][movies['NAME']=='INSTERSTELLERS']

In [ ]:
movies['NAME']

In [ ]:
movies['GENRE'][movies['NAME']=='INSTERSTELLERS'].values[0]

In [ ]:
movies['GENRE'][movies['NAME'].str.lower()=='INSTERSTELLERS'.lower()].values[0]

In [ ]:
movies

In [ ]:
movies.drop(['ID'],axis=1,inplace=True)

In [ ]:
names=movies['NAME']

In [ ]:
names.to_list()

In [ ]:
names.str.find('e')

In [ ]:
names.str.get_dummies()

In [ ]:
movies['GENRE'].str.get_dummies()

In [ ]:
names.str.join('.')

In [ ]:
names.str.split('E').str.join('--+--')

In [ ]:
names.str.strip()

In [ ]:
movies['GENRE'][movies['NAME'].str.strip().str.lower()=='INSTERSTELLERS'.lower()].values[0]

# what is the average duration of each genre

In [ ]:
movies['GENRE'].unique()

In [ ]:
movies['GENRE'].nunique()

In [ ]:
movies['GENRE'].value_counts()

In [ ]:
for genre in movies['GENRE'].unique():
 print(genre,movies[movies['GENRE']==genre]['DURATION'].mean())

In [ ]:
movies.groupby('GENRE')['DURATION'].mean()

In [ ]:
movies.groupby(['GENRE','INDUSTRY'])['DURATION'].mean()

In [ ]:
movies.groupby(['INDUSTRY','GENRE'])['DURATION'].mean()

In [ ]:
movies.describe()

In [ ]:
movies.describe(include='all')

In [ ]:
movies.info()

In [ ]:
movies.groupby('INDUSTRY').describe()

In [ ]:
movies.groupby('INDUSTRY').describe().T

In [ ]:
movies.groupby(['INDUSTRY','GENRE']).describe().T

 # average rating each industry

In [ ]:
movies.groupby('INDUSTRY')['RATING'].mean()

# average rating of romantic movies industry wise

In [ ]:
movies[movies['GENRE'].str.lower()=='romantic'].groupby('INDUSTRY')['RATING'].mean()

### list down all the english movies with their respective rating in descending order

In [ ]:
movies[movies['LANGUAGE'].str.lower()=='ENGLISH'][['NAME','RATING']].sort_values(by='RATING',ascending=False)

In [ ]:
movies

In [7]:
import numpy as np
import pandas as pd

In [8]:
data = {'country':['india','USA','japan','china','india','USA'],
        'year':['2010','2010','2010','2015','2015','2015'],
        'continent':['Asia','NA','Asia','Asia','Asia','NA'],
        'Value':[20,10,40,50,60,55]
                   
                   }

In [9]:
df= pd.DataFrame(data)

In [10]:
df

  country  year continent  Value
0   india  2010      Asia     20
1     USA  2010        NA     10
2   japan  2010      Asia     40
3   china  2015      Asia     50
4   india  2015      Asia     60
5     USA  2015        NA     55

In [11]:
pd.pivot_table(df,index=['year'],aggfunc='sum')

      Value
year
2010     70
2015    165

In [12]:
pd.pivot_table(df,index=['continent'],aggfunc='sum')

           Value
continent
Asia         170
NA            65

# concat

In [13]:
people1 = {'id':[1,2,3,4,],
         'name':['ab','rf','kl','ed'],
         'age':[45,25,41,30]
        }


people2 = {'id':[11,22,33,44,],
         'name':['awb','rgf','kal','ejd'],
         'age':[35,15,40,35]
        }


people3 = {'id':[111,222,333,444,],
         'name':['oab','rnf','kml','ecd'],
         'age':[55,75,81,50]
        }

In [14]:
df1=pd.DataFrame(people1)
df2=pd.DataFrame(people2)
df3=pd.DataFrame(people3)

In [15]:
df1

   id name  age
0   1   ab   45
1   2   rf   25
2   3   kl   41
3   4   ed   30

In [16]:
df2

   id name  age
0  11  awb   35
1  22  rgf   15
2  33  kal   40
3  44  ejd   35

In [17]:
df3

    id name  age
0  111  oab   55
1  222  rnf   75
2  333  kml   81
3  444  ecd   50

In [18]:
pd.concat([df1,df2,df3])

    id name  age
0    1   ab   45
1    2   rf   25
2    3   kl   41
3    4   ed   30
0   11  awb   35
1   22  rgf   15
2   33  kal   40
3   44  ejd   35
0  111  oab   55
1  222  rnf   75
2  333  kml   81
3  444  ecd   50

In [19]:
pd.concat([df1,df2,df3],ignore_index=True)

     id name  age
0     1   ab   45
1     2   rf   25
2     3   kl   41
3     4   ed   30
4    11  awb   35
5    22  rgf   15
6    33  kal   40
7    44  ejd   35
8   111  oab   55
9   222  rnf   75
10  333  kml   81
11  444  ecd   50

In [20]:
pd.concat([df1,df2,df3],axis=1)

   id name  age  id name  age   id name  age
0   1   ab   45  11  awb   35  111  oab   55
1   2   rf   25  22  rgf   15  222  rnf   75
2   3   kl   41  33  kal   40  333  kml   81
3   4   ed   30  44  ejd   35  444  ecd   50

In [21]:
people4 = {'id':[1,2,3,4,],
         'name':['ab','rf','kl','ed'],
         'age':[45,25,41,30]
        }


people5 = {'id':[1,2,3,4,],
         'name':['ab','rf','kl','ed'],
         'sales':[535,435,540,235]
        }

In [22]:
df4=pd.DataFrame(people4)
df5=pd.DataFrame(people5)

In [23]:
pd.merge(df4,df5,on=['id','name'])

   id name  age  sales
0   1   ab   45    535
1   2   rf   25    435
2   3   kl   41    540
3   4   ed   30    235

In [24]:
pd.merge(df4,df5,on=['id'])

   id name_x  age name_y  sales
0   1     ab   45     ab    535
1   2     rf   25     rf    435
2   3     kl   41     kl    540
3   4     ed   30     ed    235

In [25]:
people6 = {'id':[1,2,3,4,],
         'name':['ab','rf','kl','ed'],
         'age':[45,25,41,30]
        }


people7 = {
         's_name':['b','r','l','d'],
         'ph':[1254535,87549435,56421540,78945235]
        }

In [26]:
df6 = pd.DataFrame(people6)
df7 = pd.DataFrame(people7)

In [27]:
df6.join(df7)

   id name  age s_name        ph
0   1   ab   45      b   1254535
1   2   rf   25      r  87549435
2   3   kl   41      l  56421540
3   4   ed   30      d  78945235

In [28]:
d1 = pd.read_csv('mytsv.tsv')

In [29]:
d1

    name             age           roll
0   'akash'           21            100
1   'akshat'          22            101
2  'sunny'            20          102\t
3                'bunny'\t\t25\t\t  103
4   'ashis'          24             104

In [30]:
d2=pd.read_csv('mysemi.txt',sep=';')
d2

       name  age  roll
0   'akash'   21   100
1  'akshat'   22   101
2   'sunny'   20   102
3   'bunny'   25   103
4   'ashis'   24   104

# creating a json file

In [31]:
df6

   id name  age
0   1   ab   45
1   2   rf   25
2   3   kl   41
3   4   ed   30

In [32]:
df6.to_json('myjson.json')

In [33]:
d4=pd.read_json('myjson.json')
d4

   id name  age
0   1   ab   45
1   2   rf   25
2   3   kl   41
3   4   ed   30

In [34]:
df5

   id name  sales
0   1   ab    535
1   2   rf    435
2   3   kl    540
3   4   ed    235

In [35]:
df5.to_csv('mycsvvv.csv')

In [36]:
dfm=pd.read_csv('movies.csv')
dfr=pd.read_csv('ratings.csv')

In [37]:
dfm.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy